# 5 データベースとSQLの基礎（MySQL）

- **[5.1 この章の概要](#5.1-この章の概要)**
    - [5.1.1 データベースとは](#5.1.1-データベースとは)
    - [5.1.2 RDBMS](#5.1.2-RDBMS)
<br><br>
- **[5.2 SQLの基礎](#5.2-SQLの基礎)** 
    - [5.2.1 データベースとテーブルの作成](#5.2.1-データベースとテーブルの作成)
    - [5.2.2 データの検索と更新、削除、テーブルカラムの変更](#5.2.2-データの検索と更新、削除、テーブルカラムの変更)
    - [5.2.3 データの集計、演算、並び替え](#5.2.3-データの集計、演算、並び替え)
    - [5.2.4 グループごとの集計](#5.2.4-グループごとの集計)
    - [5.2.5 複数テーブルの利用](#5.2.5-複数テーブルの利用)
    - [5.2.6 case文とサブクエリ](#5.2.6-case文とサブクエリ)
<br><br> 
- **[5.3 ビュー](#5.3-ビュー)** 
    - [5.3.1 ビュー](#5.3.1-ビュー)
<br><br>
- **[5.4 総合問題](#5.4-総合問題)**
    - [5.4.1 総合問題1](#5.4.1-総合問題1)
    - [5.4.2 総合問題2](#5.4.2-総合問題2)

## 5.1 この章の概要
ゴール：データベースの役割を知る

### 5.1.1 データベースとは
キーワード：データベース、RDBMS

ここからはデータベースについて学んでいきます。データベースとは、簡単にいいますと、コンピューターを利用して膨大なデータをまとめて、後から色々なニーズに対して活用できるように、管理されたデータの集まりのことです。具体的には、ある店舗の毎日の売り上げをデータベースで管理していることもありますし、顧客の個人情報、社員の給料情報、金融の取引データ、ウェブサイトのアクセスログデータ等もデータベースで管理されたりしています。これらのデータは日々追加されますし、何かの集計（1ヶ月の売り上げの計算など）をするときはデータベースからデータが抽出され、必要なければ削除されます。

それでは、そもそも何故データベースが必要なのでしょうか。小さなデータで、一貫性等を求められていなければ、Excelで十分かもしれません。しかし、データは日々大きくなっていきますし、昨今は特にIoTなどが注目されており、リアルタイムに膨大な量のデータが生まれています。ビッグデータと言われる現代、データソースのテーブルに1億レコード以上あるということもしばしばあり、これをExcelで集計することは困難でしょう。データベースとそれを呼び出すためのSQLという言語を使うことで、大きなデータに対しても効率的に作業ができるのです。（ただし、昨今はビッグデータを扱う際にHadoopやSparkなどの分散処理をするソフトウェアなどが使われるようになっており、この講座でも10章で少し触れます。）

さらに管理するという視点でも、Excelでは限界があります。Excelは基本的に誰でも編集ができますし、後からデータに問題があった場合に対処するのが困難です。データベースを使うことで、容易に管理できます。

以下の参考文献が初心者にはわかりやすいので、全くSQLの経験がない方は前半のみ一読をおすすめします。

>[参考文献]

>『基礎からのMySQL 改訂版 (基礎からシリーズ) 』（西沢 夢路 (著)、 SBクリエイティブ）

### 5.1.2 RDBMS
キーワード：RDMBS、MySQL、テーブル

この3章で学ぶデータベースのシステムは、RDBMSと言われるリレーショナルデータベースを管理するシステムです。代表的な製品に、Oracle, Microsoft SQL Server, PostgreSQL, MySQLなどがあります。ここでは、MariaDBというデータベースを使用します。以下は、データベースのイメージです。

![comment](https://www.mysql.com/common/images/products/MySQL_Workbench_Visual_Design_Windows.gif)

参照URL：https://www.mysql.com/common/images/products/MySQL_Workbench_Visual_Design_Windows.gif

データベースにはテーブルがあり、データはそのテーブルから抽出します。テーブルは幾つかのカラムから構成され、それぞれ型の異なるデータが入っています。Excelでは、同じ列に数字や文字など、色々な型のデータを混在して入れることができますが、データベースのテーブルには同じ型を指定してデータを入れる必要があります。それらの扱い方についても、後で学びます。

ここでデータベースに関する簡単な紹介は終わります。他にも色々な概念がありますが、まずはデータをハンドリングできるように、次より実装中心に学んでいきましょう。SQLもまた手を動かしながら学ぶことで、早く使えるようになります。

## 5.2 SQLの基礎
ゴール：SQLの基礎的な操作方法を身につける

### 5.2.1 データベースとテーブルの作成
キーワード：データベース作成、テーブル、show databases,use,show tables, create, select,

早速、今あるデータベースにどんなものがあるのか見ていきましょう。以下のshow databases;でデータベースを表示することができます。（なお、本章と6章はSQLでの実行を中心としますので、ここで練習されるのはSQLのみにしてください。Pythonは基本的に実行できません。もし実行したい場合は、Pythonの章で練習しましょう。ただし、カーネルを変更することでPythonは実行可能です。）

** 注意：以下、練習問題も含め、可能な限り上から実行するようにしてください。あとの問題で使います。**

In [4]:
show databases;

show databases;
+--------------------+
| Database           |
+--------------------+
| TEST1              |
| TEST2              |
| information_schema |
| mysql              |
| performance_schema |
+--------------------+
5 rows in set (0.01 sec)

MariaDB [(none)]

ここに、新しいデータベースを追加してみましょう。create databaseを使い、その後に、データベース名を決めて実行します。ここでは、TEST1という名前にしています。

In [5]:
create database TEST1;

create database TEST1;
 ERROR 1007 (HY000): Can't create database 'TEST1'; database exists
MariaDB [(none)]

作ったデータベースがあるか確認してみましょう。先ほど追加したTEST1というデータベースが追加されていることがわかります。

In [6]:
show databases;

show databases;
+--------------------+
| Database           |
+--------------------+
| TEST1              |
| TEST2              |
| information_schema |
| mysql              |
| performance_schema |
+--------------------+
5 rows in set (0.00 sec)

MariaDB [(none)]

useを実行することで、これから使うデータベースを選択します。show tablesで今選択しているデータベースのテーブル一覧を表示させることができます。ここに使うテーブルを作成していきますが、まだ空です。

In [7]:
use TEST1;
show tables;

use TEST1; show tables;
+-----------------+
| Tables_in_TEST1 |
+-----------------+
| cardtb          |
| meibo           |
| meibo2          |
| score           |
+-----------------+
4 rows in set (0.00 sec)

MariaDB [TEST1]

ここにデータベースを作成していきます。テーブルにデータが入り、データのカラム名とその型を指定します。実際にテーブルを作ってみましょう。以下のようにcreate tableを実行しますが、要注意です。最初にテーブル名、データの型と名前等を付けています。ここではmeiboテーブルに整数型のid、文字型のnameを設定しています。さらに、primary keyというのは、このカラムが一意のキーとなっていることを宣言しています。つまり、同じデータは入らないということです。

In [5]:
create table meibo
  (id int primary key, name varchar(20))
  engine = MyISAM
  default charset = utf8;

create table meibo (id int primary key, name varchar(20)) engine = MyISAM default charset = utf8;
 Query OK, 0 rows affected (0.01 sec)

MariaDB [TEST1]

もう一度、テーブルがあるかどうか確認しましょう。

In [6]:
show tables;

show tables;
+-----------------+
| Tables_in_TEST1 |
+-----------------+
| meibo           |
+-----------------+
1 row in set (0.00 sec)

MariaDB [TEST1]

さて、ここでテーブルからデータを引っ張る時に、以下のようにselect * from テーブル名という書き方をします。アスタリスクは、すべての列名を持ってくるという意味です。ただ、以下のselect文を実行しても、空のテーブルだけなので、中身は何もなく、Empty setと表示されます。

In [7]:
select * from meibo;

select * from meibo;
 Empty set (0.00 sec)

MariaDB [TEST1]

用意したテーブルに、データを挿入してみましょう。データの挿入はinsert into を使います。その後に、「テーブル名（カラム名）values 挿入したいデータ」で実行します。以下のように記述して、データを3レコード挿入しています。

In [8]:
insert into meibo (id, name) values (1, "Abe");
insert into meibo (id, name) values (2, "Asou");
insert into meibo (id, name) values (3, "Suga");

insert into meibo (id, name) values (1, "Abe"); insert into meibo (id, name) values (2, "Asou"); insert into meibo (id, name) values (3, "Suga");
 Query OK, 1 row affected (0.00 sec)

Query OK, 1 row affected (0.00 sec)

Query OK, 1 row affected (0.00 sec)

MariaDB [TEST1]

もう一度、テーブルを確認してみましょう。

In [11]:
select * from meibo;

select * from meibo;
+----+------+
| id | name |
+----+------+
|  1 | Abe  |
|  2 | Asou |
|  3 | Suga |
+----+------+
3 rows in set (0.00 sec)

MariaDB [TEST1]

なお、同じキーとなるidのデータを入れるとエラーが出て、以下のようになります。

In [10]:
insert into meibo (id, name) values (1, "Yamada");

insert into meibo (id, name) values (1, "Yamada");
 ERROR 1062 (23000): Duplicate entry '1' for key 'PRIMARY'
MariaDB [TEST1]

>**[ポイント]**

>show databases：データベースの一覧表示

>use [データベース名]：データベースの選択

>create database [データベース名]：データベースの作成

>create table [テーブル名] [カラム名 型]：テーブルの作成

>create table [テーブル名] [カラム名 型] primary key：プライマリーキーの設定

>select * from テーブル名：テーブル名のカラムすべてのデータを問い合わせ

>instert into [テーブル名] [カラム名 型] [値]：データの挿入

#### <練習問題 1>

セルを追加（左上にある＋を押下）して、今あるデータベースを表示させましょう。そして、新しいデータベース（TEST2など）を作って、そのデータベースを使うように選択しましょう。

In [13]:
show databases

show databases;
+--------------------+
| Database           |
+--------------------+
| TEST1              |
| information_schema |
| mysql              |
| performance_schema |
+--------------------+
4 rows in set (0.00 sec)

MariaDB [TEST1]

In [16]:
create database TEST2;

create database TEST2;
 Query OK, 1 row affected (0.00 sec)

MariaDB [TEST1]

In [17]:
use TEST2

use TEST2;
 Database changed
MariaDB [TEST2]

#### <練習問題 2>

練習問題１で作成、選択したデータベースに新しいテーブル「meibo2」を作成してください。作成後はテーブルが完成しているか、確認しましょう。

In [19]:
create table meibo2
(id int primary key, name varchar(20))

create table meibo2 (id int primary key, name varchar(20));
 Query OK, 0 rows affected (0.02 sec)

MariaDB [TEST2]

In [20]:
select * from meibo2

select * from meibo2;
 Empty set (0.00 sec)

MariaDB [TEST2]

#### <練習問題 3>

新しく作ったテーブルにデータを追加してみましょう。追加後は、確かにデータが入っているか確認してください。

In [21]:
insert into meibo2 (id, name) values(1, 'iPhone 5s')

insert into meibo2 (id, name) values(1, 'iPhone 5s');
 Query OK, 1 row affected (0.00 sec)

MariaDB [TEST2]

In [22]:
select * from meibo2

select * from meibo2;
+----+-----------+
| id | name      |
+----+-----------+
|  1 | iPhone 5s |
+----+-----------+
1 row in set (0.00 sec)

MariaDB [TEST2]

### 5.2.2 データの検索と更新、削除、テーブルカラムの変更
キーワード：where, in, like, update, delete, alter

次は、データの抽出をするときに、条件を絞って実行してみましょう。条件はwhere文を使います。以下では、id=2の人のデータを抽出しています。<br>注：上記の練習問題を解いた後は、参照しているデータベースが異なるので、データベースTEST1を再選択しましょう。

In [23]:
/*データベースの選択*/
use TEST1;

/*データベースの選択*/ use TEST1;
 Database changed
MariaDB [TEST1]

In [24]:
select * from meibo where id=2;

select * from meibo where id=2;
+----+------+
| id | name |
+----+------+
|  2 | Asou |
+----+------+
1 row in set (0.00 sec)

MariaDB [TEST1]

次は、テーブルにidが1か2かどちらかあるときです。inを使っています。（他、データの範囲を絞り込むためbetweenなどもありますので、調べてみてください。）

In [25]:
select * from meibo where id in (1,2);

select * from meibo where id in (1,2);
+----+------+
| id | name |
+----+------+
|  1 | Abe  |
|  2 | Asou |
+----+------+
2 rows in set (0.00 sec)

MariaDB [TEST1]

以下のような記述で、曖昧検索もできます。likeを使って、以下の処理では、Sからはじまって後は任意の文字列ということで、「S%」としています。他にも、「%S」や「%S%」で検索が可能です。

In [26]:
select * from meibo where name like 'S%';

select * from meibo where name like 'S%';
+----+------+
| id | name |
+----+------+
|  3 | Suga |
+----+------+
1 row in set (0.01 sec)

MariaDB [TEST1]

>**[やってみよう]**

>上の条件式を色々と変更してデータを検索してみましょう。例えば、idが1以外の人や、nameがaで終わる人はどのように検索しますか？

In [32]:
select * from meibo where id !=1;
select * from meibo where name like '%e';

select * from meibo where id !=1; select * from meibo where name like '%e';
+----+------+
| id | name |
+----+------+
|  2 | Asou |
|  3 | Suga |
+----+------+
2 rows in set (0.00 sec)

+----+------+
| id | name |
+----+------+
|  1 | Abe  |
+----+------+
1 row in set (0.00 sec)

MariaDB [TEST1]

今までは存在してるデータを抽出してきましたが、次は、データを変更してみます。updateを使って、id=3の人を更新してみます。記述方法は以下のようになります。

In [33]:
update meibo
 set name = "Inami"
 where id=3;

update meibo set name = "Inami" where id=3;
 Query OK, 1 row affected (0.01 sec)
Rows matched: 1  Changed: 1  Warnings: 0

MariaDB [TEST1]

更新されているか確かめてみましょう。

In [34]:
select * from meibo;

select * from meibo;
+----+-------+
| id | name  |
+----+-------+
|  1 | Abe   |
|  2 | Asou  |
|  3 | Inami |
+----+-------+
3 rows in set (0.00 sec)

MariaDB [TEST1]

データを削除する場合も扱いましょう。データを用意(id=4)して、確認します。

In [35]:
insert into meibo (id, name) values (4, "Dummy");
select * from meibo;

insert into meibo (id, name) values (4, "Dummy"); select * from meibo;
+----+-------+
| id | name  |
+----+-------+
|  1 | Abe   |
|  2 | Asou  |
|  3 | Inami |
|  4 | Dummy |
+----+-------+
4 rows in set (0.00 sec)

MariaDB [TEST1]

データの削除はdeleteを使います。ここでは、先ほど用意しましたid＝4の人を削除します。

In [36]:
delete from meibo
where id = 4;

delete from meibo where id = 4;
 Query OK, 1 row affected (0.00 sec)

MariaDB [TEST1]

念のため、消えているかどうか確認しましょう。

In [37]:
select * from meibo;

select * from meibo;
+----+-------+
| id | name  |
+----+-------+
|  1 | Abe   |
|  2 | Asou  |
|  3 | Inami |
+----+-------+
3 rows in set (0.00 sec)

MariaDB [TEST1]

次は、新しいカラムを追加しましょう。その人のクラスと年齢を追加します。「alter table テーブル名 add 新しいカラム名 型」です。

In [38]:
alter table meibo add class int;
alter table meibo add age int;

alter table meibo add class int; alter table meibo add age int;
Query OK, 3 rows affected (0.01 sec)
Records: 3  Duplicates: 0  Warnings: 0

Query OK, 3 rows affected (0.01 sec)
Records: 3  Duplicates: 0  Warnings: 0

MariaDB [TEST1]

新しくカラムを追加したテーブルをチェックしてみましょう。classとageには、まだ何もデータは入っていないので、NULLになります。

In [39]:
select * from meibo;

select * from meibo;
+----+-------+-------+------+
| id | name  | class | age  |
+----+-------+-------+------+
|  1 | Abe   |  NULL | NULL |
|  2 | Asou  |  NULL | NULL |
|  3 | Inami |  NULL | NULL |
+----+-------+-------+------+
3 rows in set (0.00 sec)

MariaDB [TEST1]

updateを使ってデータを更新します。

In [40]:
update meibo
 set class =1, age=13
 where id = 3;

update meibo set class =1, age=13 where id = 3;
 Query OK, 1 row affected (0.01 sec)
Rows matched: 1  Changed: 1  Warnings: 0

MariaDB [TEST1]

id=3の人のにクラスと年齢のデータが入りました。

In [41]:
select * from meibo;

select * from meibo;
+----+-------+-------+------+
| id | name  | class | age  |
+----+-------+-------+------+
|  1 | Abe   |  NULL | NULL |
|  2 | Asou  |  NULL | NULL |
|  3 | Inami |     1 |   13 |
+----+-------+-------+------+
3 rows in set (0.00 sec)

MariaDB [TEST1]

続けて、他の人のデータも更新しましょう。

In [42]:
update meibo
 set class=1,age=14
 where id=1;
 
update meibo
 set class=2,age=13
 where id=2;

update meibo set class=1,age=14 where id=1; update meibo set class=2,age=13 where id=2;
 Query OK, 1 row affected (0.00 sec)
Rows matched: 1  Changed: 1  Warnings: 0

Query OK, 1 row affected (0.00 sec)
Rows matched: 1  Changed: 1  Warnings: 0

MariaDB [TEST1]

In [43]:
select * from meibo;

select * from meibo;
+----+-------+-------+------+
| id | name  | class | age  |
+----+-------+-------+------+
|  1 | Abe   |     1 |   14 |
|  2 | Asou  |     2 |   13 |
|  3 | Inami |     1 |   13 |
+----+-------+-------+------+
3 rows in set (0.00 sec)

MariaDB [TEST1]

新しい人たちのデータを追加しましょう。先ほどはinsertを1つ1つ実行していきました。ここでは、以下のコマンドで一度に更新します。

In [44]:
insert into meibo (id,name,class,age) 
 values (4,"Asou",2,15),(5,"Imamura",3,12),(6,"Takeuchi",2,16),(7,"Kimura",3,11),(8,"Sato",1,14);

insert into meibo (id,name,class,age) values (4,"Asou",2,15),(5,"Imamura",3,12),(6,"Takeuchi",2,16),(7,"Kimura",3,11),(8,"Sato",1,14);
 Query OK, 5 rows affected (0.00 sec)
Records: 5  Duplicates: 0  Warnings: 0

MariaDB [TEST1]

データの確認をします。

In [45]:
select * from meibo;

select * from meibo;
+----+----------+-------+------+
| id | name     | class | age  |
+----+----------+-------+------+
|  1 | Abe      |     1 |   14 |
|  2 | Asou     |     2 |   13 |
|  3 | Inami    |     1 |   13 |
|  4 | Asou     |     2 |   15 |
|  5 | Imamura  |     3 |   12 |
|  6 | Takeuchi |     2 |   16 |
|  7 | Kimura   |     3 |   11 |
|  8 | Sato     |     1 |   14 |
+----+----------+-------+------+
8 rows in set (0.00 sec)

MariaDB [TEST1]

>**[ポイント]**

>select * from [テーブル名] where 条件：条件でデータを絞り込み

>in：条件マッチ

>like：曖昧検索

>delete from [テーブル名]：データの削除（注：条件を絞りこむ場合はwhere文を追加する）

>alter table [テーブル名] add [カラム名 型]:テーブルのカラム名追加

>update [テーブル名] set ：データのアップデート

#### <練習問題 1>

TEST1のデータベースを選択して、上記のテーブルmeiboにて、id=4の人レコードを抽出してください。

In [46]:
select * from meibo where id = 4

select * from meibo where id = 4;
+----+------+-------+------+
| id | name | class | age  |
+----+------+-------+------+
|  4 | Asou |     2 |   15 |
+----+------+-------+------+
1 row in set (0.00 sec)

MariaDB [TEST1]

#### <練習問題 2>

上のmeiboテーブルでid=8の人のclassを7にアップデートしてください。

In [47]:
update meibo
set class = 7
where id = 8

update meibo set class = 7 where id = 8;
 Query OK, 1 row affected (0.00 sec)
Rows matched: 1  Changed: 1  Warnings: 0

MariaDB [TEST1]

In [48]:
select * from meibo

select * from meibo;
+----+----------+-------+------+
| id | name     | class | age  |
+----+----------+-------+------+
|  1 | Abe      |     1 |   14 |
|  2 | Asou     |     2 |   13 |
|  3 | Inami    |     1 |   13 |
|  4 | Asou     |     2 |   15 |
|  5 | Imamura  |     3 |   12 |
|  6 | Takeuchi |     2 |   16 |
|  7 | Kimura   |     3 |   11 |
|  8 | Sato     |     7 |   14 |
+----+----------+-------+------+
8 rows in set (0.00 sec)

MariaDB [TEST1]

#### <練習問題 3>

上記と同じテーブルmeiboに新しい列highという身長を追加してください。さらに、id=1から4までの人は150、id=5から6までの人は155、id=7から8までの人は160でアップデートしてください。

In [49]:
alter table meibo add height int

alter table meibo add height int;
Query OK, 8 rows affected (0.01 sec)
Records: 8  Duplicates: 0  Warnings: 0

MariaDB [TEST1]

In [51]:
update meibo
set height = 150
where id between 1 and 4

update meibo set height = 150 where id between 1 and 4;
 Query OK, 4 rows affected (0.00 sec)
Rows matched: 4  Changed: 4  Warnings: 0

MariaDB [TEST1]

In [52]:
update meibo
set height = 155
where id in (5,6)

update meibo set height = 155 where id in (5,6);
 Query OK, 2 rows affected (0.00 sec)
Rows matched: 2  Changed: 2  Warnings: 0

MariaDB [TEST1]

In [53]:
update meibo set height = 160 where id in (7,8)

update meibo set height = 160 where id in (7,8);
 Query OK, 2 rows affected (0.00 sec)
Rows matched: 2  Changed: 2  Warnings: 0

MariaDB [TEST1]

In [54]:
select * from meibo

select * from meibo;
+----+----------+-------+------+--------+
| id | name     | class | age  | height |
+----+----------+-------+------+--------+
|  1 | Abe      |     1 |   14 |    150 |
|  2 | Asou     |     2 |   13 |    150 |
|  3 | Inami    |     1 |   13 |    150 |
|  4 | Asou     |     2 |   15 |    150 |
|  5 | Imamura  |     3 |   12 |    155 |
|  6 | Takeuchi |     2 |   16 |    155 |
|  7 | Kimura   |     3 |   11 |    160 |
|  8 | Sato     |     7 |   14 |    160 |
+----+----------+-------+------+--------+
8 rows in set (0.00 sec)

MariaDB [TEST1]

### 5.2.3 データの集計、演算、並び替え
キーワード：count,distinct,order,avg,sum,limit

次は、SQLを使った集計になります。データを見るときにまず気になるのが、何レコードあるかということです。以下で、データが何行あるかカウントするために、countを使っています。

In [55]:
select count(*) from meibo;

select count(*) from meibo;
+----------+
| count(*) |
+----------+
|        8 |
+----------+
1 row in set (0.00 sec)

MariaDB [TEST1]

なお、asで名前をつけることができます。エイリアスといいます。cntというカラム名をつけてみましょう。

In [56]:
select count(*) as cnt from meibo;

select count(*) as cnt from meibo;
+-----+
| cnt |
+-----+
|   8 |
+-----+
1 row in set (0.00 sec)

MariaDB [TEST1]

次は、このcountを使って、異なる種類のデータを数えてみます。具体的には、先ほどレコード数は8レコードありましたが、異なるクラスは何クラスあるでしょうか。countとdistinct を併用することで、重複を除いた件数をカウントできます。

In [57]:
select count(distinct class) as classCnt from meibo;

select count(distinct class) as classCnt from meibo;
+----------+
| classCnt |
+----------+
|        4 |
+----------+
1 row in set (0.00 sec)

MariaDB [TEST1]

次は、平均を計算します。以下は、平均年齢を計算しています。avgを使います。

In [58]:
select avg(age) as avgAge from meibo;

select avg(age) as avgAge from meibo;
+---------+
| avgAge  |
+---------+
| 13.5000 |
+---------+
1 row in set (0.00 sec)

MariaDB [TEST1]

なお、sum関数を使うと合計されますが、年齢の合計の用途はあまりなさそうです。ここでは、先ほどのcountと組み合わせて、平均年齢を算出しましょう。上記の結果と同じになっていることがわかります。このように、selectの中で演算が可能です。

In [59]:
select sum(age) / count(*) as avgAge from meibo;

select sum(age) / count(*) as avgAge from meibo;
+---------+
| avgAge  |
+---------+
| 13.5000 |
+---------+
1 row in set (0.00 sec)

MariaDB [TEST1]

年齢最大値と最小値は以下のように記述します。最年少が11歳、最年長が16歳とわかります。

In [60]:
select min(age) as minAge, max(age) as maxAge from meibo;

select min(age) as minAge, max(age) as maxAge from meibo;
+--------+--------+
| minAge | maxAge |
+--------+--------+
|     11 |     16 |
+--------+--------+
1 row in set (0.00 sec)

MariaDB [TEST1]

次は、idを軸として降順に並べてみましょう。並び替えはorder by カラム名を使います。descをつけることで、降順（大きいものから小さいものの順番）になります。

In [61]:
select * from meibo order by id desc;

select * from meibo order by id desc;
+----+----------+-------+------+--------+
| id | name     | class | age  | height |
+----+----------+-------+------+--------+
|  8 | Sato     |     7 |   14 |    160 |
|  7 | Kimura   |     3 |   11 |    160 |
|  6 | Takeuchi |     2 |   16 |    155 |
|  5 | Imamura  |     3 |   12 |    155 |
|  4 | Asou     |     2 |   15 |    150 |
|  3 | Inami    |     1 |   13 |    150 |
|  2 | Asou     |     2 |   13 |    150 |
|  1 | Abe      |     1 |   14 |    150 |
+----+----------+-------+------+--------+
8 rows in set (0.00 sec)

MariaDB [TEST1]

今度は、ageを軸として昇順（小さいものから大きいものの順番）に並べてみましょう。デフォルトは昇順です。

In [62]:
select * from meibo order by age;

select * from meibo order by age;
+----+----------+-------+------+--------+
| id | name     | class | age  | height |
+----+----------+-------+------+--------+
|  7 | Kimura   |     3 |   11 |    160 |
|  5 | Imamura  |     3 |   12 |    155 |
|  2 | Asou     |     2 |   13 |    150 |
|  3 | Inami    |     1 |   13 |    150 |
|  1 | Abe      |     1 |   14 |    150 |
|  8 | Sato     |     7 |   14 |    160 |
|  4 | Asou     |     2 |   15 |    150 |
|  6 | Takeuchi |     2 |   16 |    155 |
+----+----------+-------+------+--------+
8 rows in set (0.00 sec)

MariaDB [TEST1]

class,ageの2つの軸で昇順に並べてみましょう。なお、優先順位は先に記述したカラムになります。この場合は、classです。

In [63]:
select * from meibo order by class,age;

select * from meibo order by class,age;
+----+----------+-------+------+--------+
| id | name     | class | age  | height |
+----+----------+-------+------+--------+
|  3 | Inami    |     1 |   13 |    150 |
|  1 | Abe      |     1 |   14 |    150 |
|  2 | Asou     |     2 |   13 |    150 |
|  4 | Asou     |     2 |   15 |    150 |
|  6 | Takeuchi |     2 |   16 |    155 |
|  7 | Kimura   |     3 |   11 |    160 |
|  5 | Imamura  |     3 |   12 |    155 |
|  8 | Sato     |     7 |   14 |    160 |
+----+----------+-------+------+--------+
8 rows in set (0.00 sec)

MariaDB [TEST1]

limitを使うと行数の制限ができます。数多くのデータがありそうなときは、limitを使ってデータを確認しましょう。

In [64]:
select * from meibo limit 3;

select * from meibo limit 3;
+----+-------+-------+------+--------+
| id | name  | class | age  | height |
+----+-------+-------+------+--------+
|  1 | Abe   |     1 |   14 |    150 |
|  2 | Asou  |     2 |   13 |    150 |
|  3 | Inami |     1 |   13 |    150 |
+----+-------+-------+------+--------+
3 rows in set (0.00 sec)

MariaDB [TEST1]

次は、複数条件での絞り込みです。同時条件で絞り込む場合はandを使います。

In [65]:
select * from meibo where class=2 and age>=15;

select * from meibo where class=2 and age>=15;
+----+----------+-------+------+--------+
| id | name     | class | age  | height |
+----+----------+-------+------+--------+
|  4 | Asou     |     2 |   15 |    150 |
|  6 | Takeuchi |     2 |   16 |    155 |
+----+----------+-------+------+--------+
2 rows in set (0.00 sec)

MariaDB [TEST1]

次は、or です。どちらか片方の条件を満たすものを絞り込む場合に使います。

In [66]:
select * from meibo where class=1 or age>=15;

select * from meibo where class=1 or age>=15;
+----+----------+-------+------+--------+
| id | name     | class | age  | height |
+----+----------+-------+------+--------+
|  1 | Abe      |     1 |   14 |    150 |
|  3 | Inami    |     1 |   13 |    150 |
|  4 | Asou     |     2 |   15 |    150 |
|  6 | Takeuchi |     2 |   16 |    155 |
+----+----------+-------+------+--------+
4 rows in set (0.00 sec)

MariaDB [TEST1]

>**[ポイント]**

>count：レコードのカウント

>as：エイリアス（名前をつける）

>distinct ：重複なく区別する

>avg ：平均値

>max ：最大値

>min ：最小値

>order by カラム名：昇順に並び替え（降順はカラム名の後にdesc）

#### <練習問題 1>
上記と同じmeiboテーブルで、異なる年齢は何種類でしょうか。

In [68]:
select count(distinct age) from meibo;
select * from meibo

select count(distinct age) from meibo; select * from meibo;
+---------------------+
| count(distinct age) |
+---------------------+
|                   6 |
+---------------------+
1 row in set (0.00 sec)

+----+----------+-------+------+--------+
| id | name     | class | age  | height |
+----+----------+-------+------+--------+
|  1 | Abe      |     1 |   14 |    150 |
|  2 | Asou     |     2 |   13 |    150 |
|  3 | Inami    |     1 |   13 |    150 |
|  4 | Asou     |     2 |   15 |    150 |
|  5 | Imamura  |     3 |   12 |    155 |
|  6 | Takeuchi |     2 |   16 |    155 |
|  7 | Kimura   |     3 |   11 |    160 |
|  8 | Sato     |     7 |   14 |    160 |
+----+----------+-------+------+--------+
8 rows in set (0.00 sec)

MariaDB [TEST1]

#### <練習問題 2>
身長が一番小さい人、大きい人の身長をそれぞれ求めてください。

In [69]:
select max(height) as maxHeight, min(height) as minHeight from meibo

select max(height) as maxHeight, min(height) as minHeight from meibo;
+-----------+-----------+
| maxHeight | minHeight |
+-----------+-----------+
|       160 |       150 |
+-----------+-----------+
1 row in set (0.00 sec)

MariaDB [TEST1]

#### <練習問題 3>
身長が155以上で、classが3のレコードを抽出してください。

In [70]:
select * from meibo where height >= 155 and class =3

select * from meibo where height >= 155 and class =3;
+----+---------+-------+------+--------+
| id | name    | class | age  | height |
+----+---------+-------+------+--------+
|  5 | Imamura |     3 |   12 |    155 |
|  7 | Kimura  |     3 |   11 |    160 |
+----+---------+-------+------+--------+
2 rows in set (0.00 sec)

MariaDB [TEST1]

### 5.2.4 グループごとの集計
キーワード：group by, having

次は、SQLを使ってグループごとに集計してみましょう。似ているのはExcelのピボットテーブルの機能です。ここではクラスを軸にしてみます。次のコマンドは各クラスの人数を数えています。

In [71]:
select class, count(*) as num from meibo group by class;

select class, count(*) as num from meibo group by class;
+-------+-----+
| class | num |
+-------+-----+
|     1 |   2 |
|     2 |   3 |
|     3 |   2 |
|     7 |   1 |
+-------+-----+
4 rows in set (0.01 sec)

MariaDB [TEST1]

平均を各グループごとに算出することも可能です。最小値、最大値も同様に算出できます。

In [72]:
select class, count(*) as num, avg(age) as avgAge from meibo group by class;

select class, count(*) as num, avg(age) as avgAge from meibo group by class;
+-------+-----+---------+
| class | num | avgAge  |
+-------+-----+---------+
|     1 |   2 | 13.5000 |
|     2 |   3 | 14.6667 |
|     3 |   2 | 11.5000 |
|     7 |   1 | 14.0000 |
+-------+-----+---------+
4 rows in set (0.00 sec)

MariaDB [TEST1]

さらに条件付きで表示してみましょう。having を使っています。

In [73]:
select class, avg(age) as avgAge from meibo group by class having avgAge>13;

select class, avg(age) as avgAge from meibo group by class having avgAge>13;
+-------+---------+
| class | avgAge  |
+-------+---------+
|     1 | 13.5000 |
|     2 | 14.6667 |
|     7 | 14.0000 |
+-------+---------+
3 rows in set (0.00 sec)

MariaDB [TEST1]

whereと組み合わせることもできます。

In [74]:
select class, avg(age) as avgAge from meibo where age > 13 group by class;

select class, avg(age) as avgAge from meibo where age > 13 group by class;
+-------+---------+
| class | avgAge  |
+-------+---------+
|     1 | 14.0000 |
|     2 | 15.5000 |
|     7 | 14.0000 |
+-------+---------+
3 rows in set (0.01 sec)

MariaDB [TEST1]

whereとhavingはどちらも条件を絞っているのですが、whereはselectで抽出された中から条件を絞っていますが、havingはgroup byでグループ化した結果から条件を絞っています。

次は、2つの軸を使った集計です。クラス×年齢でレコード数をカウントしています。

In [75]:
select class, age, count(*) as num from meibo group by class,age;

select class, age, count(*) as num from meibo group by class,age;
+-------+------+-----+
| class | age  | num |
+-------+------+-----+
|     1 |   13 |   1 |
|     1 |   14 |   1 |
|     2 |   13 |   1 |
|     2 |   15 |   1 |
|     2 |   16 |   1 |
|     3 |   11 |   1 |
|     3 |   12 |   1 |
|     7 |   14 |   1 |
+-------+------+-----+
8 rows in set (0.00 sec)

MariaDB [TEST1]

番号（順）で指定して集計することも可能です。なお、group by は以下のように、呼び出している列の番号で指定することもできます。ただし、わからなくなる可能性がありますので、簡易集計以外のときにはカラム名を指定することをおすすめします。

In [45]:
select class, age, count(*) as num from meibo group by 1,2;

select class, age, count(*) as num from meibo group by 1,2;
+-------+------+-----+
| class | age  | num |
+-------+------+-----+
|     1 |   13 |   1 |
|     1 |   14 |   2 |
|     2 |   13 |   1 |
|     2 |   15 |   1 |
|     2 |   16 |   1 |
|     3 |   11 |   1 |
|     3 |   12 |   1 |
+-------+------+-----+
7 rows in set (0.00 sec)

>**[ポイント]**

>group by：軸を設定

>having：条件設定

#### <練習問題 1>

meiboテーブルにてクラスごとの平均身長を求めてみましょう。

In [78]:
select class, avg(height) as avgHeight from meibo group by class

select class, avg(height) as avgHeight from meibo group by class;
+-------+-----------+
| class | avgHeight |
+-------+-----------+
|     1 |  150.0000 |
|     2 |  151.6667 |
|     3 |  157.5000 |
|     7 |  160.0000 |
+-------+-----------+
4 rows in set (0.00 sec)

MariaDB [TEST1]

#### <練習問題 2>

上に加えて、クラスごとの人数、一番小さい人と、一番大きな人の身長もそれぞれのクラスで算出しましょう。

In [79]:
select class, avg(height) as avgHeight, min(height) as minHeight, max(height) as maxHeight from meibo group by class

select class, avg(height) as avgHeight, min(height) as minHeight, max(height) as maxHeight from meibo group by class;
+-------+-----------+-----------+-----------+
| class | avgHeight | minHeight | maxHeight |
+-------+-----------+-----------+-----------+
|     1 |  150.0000 |       150 |       150 |
|     2 |  151.6667 |       150 |       155 |
|     3 |  157.5000 |       155 |       160 |
|     7 |  160.0000 |       160 |       160 |
+-------+-----------+-----------+-----------+
4 rows in set (0.00 sec)

MariaDB [TEST1]

#### <練習問題 3>

上記と同じ設定で、年齢が13歳より上の人を抽出してください。

In [80]:
select class, avg(height), min(height), max(height) from meibo where age > 13 group by class

select class, avg(height), min(height), max(height) from meibo where age > 13 group by class;
+-------+-------------+-------------+-------------+
| class | avg(height) | min(height) | max(height) |
+-------+-------------+-------------+-------------+
|     1 |    150.0000 |         150 |         150 |
|     2 |    152.5000 |         150 |         155 |
|     7 |    160.0000 |         160 |         160 |
+-------+-------------+-------------+-------------+
3 rows in set (0.00 sec)

MariaDB [TEST1]

### 5.2.5 複数テーブルの利用
キーワード：union,union all, inner join, outer join,内部結合、外部結合、自己結合

次は複数のテーブルを使って、データを操作してみましょう。準備のため、テーブルを作成します。テーブルの作成は以前に学んだ方法でも作成できますが、再び作成するのは面倒なので、すでに作成したテーブルを「コピー」しましょう。以下のように create で新規に作成するテーブル名を指定した後、"like コピー元のテーブル名" とつづけることでテーブル構造を丸ごとコピーできます。

In [81]:
/*前のテーブルは使わないので、一旦削除します*/
drop table if exists meibo2;

/*前のテーブルは使わないので、一旦削除します*/ drop table if exists meibo2;
 Query OK, 0 rows affected, 1 warning (0.01 sec)

MariaDB [TEST1]

In [82]:
create table meibo2 like meibo;

create table meibo2 like meibo;
 Query OK, 0 rows affected (0.01 sec)

MariaDB [TEST1]

確認してみましょう。テーブルの構造をチェックするときは、descを使います。

In [83]:
/*テーブル*/
desc meibo2;

/*データの確認*/
select * from  meibo2;

/*テーブル*/ desc meibo2; /*データの確認*/ select * from  meibo2;
+--------+-------------+------+-----+---------+-------+
| Field  | Type        | Null | Key | Default | Extra |
+--------+-------------+------+-----+---------+-------+
| id     | int(11)     | NO   | PRI | NULL    |       |
| name   | varchar(20) | YES  |     | NULL    |       |
| class  | int(11)     | YES  |     | NULL    |       |
| age    | int(11)     | YES  |     | NULL    |       |
| height | int(11)     | YES  |     | NULL    |       |
+--------+-------------+------+-----+---------+-------+
5 rows in set (0.01 sec)

Empty set (0.00 sec)

MariaDB [TEST1]

データを追加します。なお、１行目はわざとmeiboにある同じデータ（Yamada）を入れています。結果を確認してみてください。

In [85]:
insert into meibo2 (id,name,class,age,height)
 values (1,"Abe",1,14,150),
        (9,"Nagata",4,11,160),
        (10,"Sugino",2,13,150),
        (11,"Takayama",1,14,155),
        (12,"Jon",3,16,165);

insert into meibo2 (id,name,class,age,height) values (1,"Abe",1,14,150), (9,"Nagata",4,11,160), (10,"Sugino",2,13,150), (11,"Takayama",1,14,155), (12,"Jon",3,16,165);
 Query OK, 5 rows affected (0.00 sec)
Records: 5  Duplicates: 0  Warnings: 0

MariaDB [TEST1]

In [86]:
select * from  meibo2;

select * from  meibo2;
+----+----------+-------+------+--------+
| id | name     | class | age  | height |
+----+----------+-------+------+--------+
|  1 | Abe      |     1 |   14 |    150 |
|  9 | Nagata   |     4 |   11 |    160 |
| 10 | Sugino   |     2 |   13 |    150 |
| 11 | Takayama |     1 |   14 |    155 |
| 12 | Jon      |     3 |   16 |    165 |
+----+----------+-------+------+--------+
5 rows in set (0.00 sec)

MariaDB [TEST1]

データを結合してみましょう。unionを使います。なお、unionは重複レコードは省きますが、union allは重複も許容します。id=1の人がunion allの場合2レコードあるのがわかります。

In [87]:
select * from  meibo
union
select * from  meibo2;

select * from  meibo union select * from  meibo2;
+----+----------+-------+------+--------+
| id | name     | class | age  | height |
+----+----------+-------+------+--------+
|  1 | Abe      |     1 |   14 |    150 |
|  2 | Asou     |     2 |   13 |    150 |
|  3 | Inami    |     1 |   13 |    150 |
|  4 | Asou     |     2 |   15 |    150 |
|  5 | Imamura  |     3 |   12 |    155 |
|  6 | Takeuchi |     2 |   16 |    155 |
|  7 | Kimura   |     3 |   11 |    160 |
|  8 | Sato     |     7 |   14 |    160 |
|  9 | Nagata   |     4 |   11 |    160 |
| 10 | Sugino   |     2 |   13 |    150 |
| 11 | Takayama |     1 |   14 |    155 |
| 12 | Jon      |     3 |   16 |    165 |
+----+----------+-------+------+--------+
12 rows in set (0.00 sec)

MariaDB [TEST1]

In [88]:
select * from  meibo
union all
select * from  meibo2;

select * from  meibo union all select * from  meibo2;
+----+----------+-------+------+--------+
| id | name     | class | age  | height |
+----+----------+-------+------+--------+
|  1 | Abe      |     1 |   14 |    150 |
|  2 | Asou     |     2 |   13 |    150 |
|  3 | Inami    |     1 |   13 |    150 |
|  4 | Asou     |     2 |   15 |    150 |
|  5 | Imamura  |     3 |   12 |    155 |
|  6 | Takeuchi |     2 |   16 |    155 |
|  7 | Kimura   |     3 |   11 |    160 |
|  8 | Sato     |     7 |   14 |    160 |
|  1 | Abe      |     1 |   14 |    150 |
|  9 | Nagata   |     4 |   11 |    160 |
| 10 | Sugino   |     2 |   13 |    150 |
| 11 | Takayama |     1 |   14 |    155 |
| 12 | Jon      |     3 |   16 |    165 |
+----+----------+-------+------+--------+
13 rows in set (0.00 sec)

MariaDB [TEST1]

テストのスコアテーブルを作成して、このmeiboテーブルと結合してみましょう。

In [89]:
create table score
  (id int primary key, math int, english int,science int)
  engine = MyISAM
  default charset = utf8;

create table score (id int primary key, math int, english int,science int) engine = MyISAM default charset = utf8;
 Query OK, 0 rows affected (0.00 sec)

MariaDB [TEST1]

In [90]:
desc score;

desc score;
+---------+---------+------+-----+---------+-------+
| Field   | Type    | Null | Key | Default | Extra |
+---------+---------+------+-----+---------+-------+
| id      | int(11) | NO   | PRI | NULL    |       |
| math    | int(11) | YES  |     | NULL    |       |
| english | int(11) | YES  |     | NULL    |       |
| science | int(11) | YES  |     | NULL    |       |
+---------+---------+------+-----+---------+-------+
4 rows in set (0.00 sec)

MariaDB [TEST1]

scoreテーブルにサンプルデータを挿入します。

In [91]:
insert into score (id,math,english,science) 
 values (1,10,10,40),(2,NULL,60,100),(3,30,40,60),
        (5,25,31,10),(6,50,30,10),(8,90,100,90),
        (9,67,71,50),(11,100,40,88),(15,76,21,13);

insert into score (id,math,english,science) values (1,10,10,40),(2,NULL,60,100),(3,30,40,60), (5,25,31,10),(6,50,30,10),(8,90,100,90), (9,67,71,50),(11,100,40,88),(15,76,21,13);
 Query OK, 9 rows affected (0.00 sec)
Records: 9  Duplicates: 0  Warnings: 0

MariaDB [TEST1]

念のためデータが入っているかどうか確認します。

In [92]:
select * from score;

select * from score;
+----+------+---------+---------+
| id | math | english | science |
+----+------+---------+---------+
|  1 |   10 |      10 |      40 |
|  2 | NULL |      60 |     100 |
|  3 |   30 |      40 |      60 |
|  5 |   25 |      31 |      10 |
|  6 |   50 |      30 |      10 |
|  8 |   90 |     100 |      90 |
|  9 |   67 |      71 |      50 |
| 11 |  100 |      40 |      88 |
| 15 |   76 |      21 |      13 |
+----+------+---------+---------+
9 rows in set (0.01 sec)

MariaDB [TEST1]

以下でidをキーに内部結合しています。テーブル名の後に別名を簡単に付けて（meibo はa、scoreはb）います。

In [26]:
select * from meibo a join score b on a.id=b.id;

select * from meibo a join score b on a.id=b.id;
+----+----------+-------+------+--------+----+------+---------+---------+
| id | name     | class | age  | height | id | math | english | science |
+----+----------+-------+------+--------+----+------+---------+---------+
|  1 | Abe      |     1 |   14 |    150 |  1 |   10 |      10 |      40 |
|  2 | Asou     |     2 |   13 |    150 |  2 | NULL |      60 |     100 |
|  3 | Inami    |     1 |   13 |    150 |  3 |   30 |      40 |      60 |
|  5 | Imamura  |     3 |   12 |    155 |  5 |   25 |      31 |      10 |
|  6 | Takeuchi |     2 |   16 |    155 |  6 |   50 |      30 |      10 |
|  8 | Sato     |     7 |   14 |    160 |  8 |   90 |     100 |      90 |
+----+----------+-------+------+--------+----+------+---------+---------+
6 rows in set (0.00 sec)

MariaDB [TEST1]

idをキーに外部結合(左)しています。左にあるテーブルがベースになります。右にデータがいない場合は、NULLになります。

In [57]:
select * from meibo a left join score b on a.id=b.id;

select * from meibo a left join score b on a.id=b.id;
+----+----------+-------+------+------+------+---------+---------+
| id | name     | class | age  | id   | math | english | science |
+----+----------+-------+------+------+------+---------+---------+
|  1 | Yamada   |     1 |   14 |    1 |   10 |      10 |      40 |
|  2 | Tanaka   |     2 |   13 |    2 | NULL |      60 |     100 |
|  3 | Suzuki   |     1 |   13 |    3 |   30 |      40 |      60 |
|  4 | Kato     |     2 |   15 | NULL | NULL |    NULL |    NULL |
|  5 | Ito      |     3 |   12 |    5 |   25 |      31 |      10 |
|  6 | Takeuchi |     2 |   16 |    6 |   50 |      30 |      10 |
|  7 | Kimura   |     3 |   11 | NULL | NULL |    NULL |    NULL |
|  8 | Sato     |     1 |   14 |    8 |   90 |     100 |      90 |
+----+----------+-------+------+------+------+---------+---------+
8 rows in set (0.00 sec)

以下は、参考ですが、自分自身のテーブルと結合をする自己結合も可能です。どんな活用方法があるかは次の章で解説します。

In [58]:
select * from meibo a join meibo b on a.id=b.id;

select * from meibo a join meibo b on a.id=b.id;
+----+----------+-------+------+----+----------+-------+------+
| id | name     | class | age  | id | name     | class | age  |
+----+----------+-------+------+----+----------+-------+------+
|  1 | Yamada   |     1 |   14 |  1 | Yamada   |     1 |   14 |
|  2 | Tanaka   |     2 |   13 |  2 | Tanaka   |     2 |   13 |
|  3 | Suzuki   |     1 |   13 |  3 | Suzuki   |     1 |   13 |
|  4 | Kato     |     2 |   15 |  4 | Kato     |     2 |   15 |
|  5 | Ito      |     3 |   12 |  5 | Ito      |     3 |   12 |
|  6 | Takeuchi |     2 |   16 |  6 | Takeuchi |     2 |   16 |
|  7 | Kimura   |     3 |   11 |  7 | Kimura   |     3 |   11 |
|  8 | Sato     |     1 |   14 |  8 | Sato     |     1 |   14 |
+----+----------+-------+------+----+----------+-------+------+
8 rows in set (0.00 sec)

>**[ポイント]**

>union：重複を除いた結合

>union all：重複ありの結合

>inner join：内部結合

>left outer join：外部結合

#### <練習問題 1>

新しくcardtbというテーブルを作成してください。ただし、カラムはid,point,money (すべてint)にしてください。さらに、以下のデータを挿入してください。<br>(id,point,money) = (1,100,1000),(2,NULL,60),(3,50,500),(4,30,600),(5,10,10),(6,NULL,40),(7,100,1000),(8,2000,100)

In [93]:
create table cardtb
(id int, point int, money int);
insert into cardtb (id, point, money)
values (1,100,1000),(2,NULL,60),(3,50,500),(4,30,600),(5,10,10),(6,NULL,40),(7,100,1000),(8,2000,100);

create table cardtb (id int, point int, money int); insert into cardtb (id, point, money) values (1,100,1000),(2,NULL,60),(3,50,500),(4,30,600),(5,10,10),(6,NULL,40),(7,100,1000),(8,2000,100);
 Query OK, 0 rows affected (0.02 sec)

Query OK, 8 rows affected (0.00 sec)
Records: 8  Duplicates: 0  Warnings: 0

MariaDB [TEST1]

In [94]:
select * from cardtb

select * from cardtb;
+------+-------+-------+
| id   | point | money |
+------+-------+-------+
|    1 |   100 |  1000 |
|    2 |  NULL |    60 |
|    3 |    50 |   500 |
|    4 |    30 |   600 |
|    5 |    10 |    10 |
|    6 |  NULL |    40 |
|    7 |   100 |  1000 |
|    8 |  2000 |   100 |
+------+-------+-------+
8 rows in set (0.00 sec)

MariaDB [TEST1]

#### <練習問題 2>

meiboテーブルにidをキーとして、上記のテーブルを内部結合させてください。

In [95]:
select * from meibo join cardtb on meibo.id = cardtb.id

select * from meibo join cardtb on meibo.id = cardtb.id;
+----+----------+-------+------+--------+------+-------+-------+
| id | name     | class | age  | height | id   | point | money |
+----+----------+-------+------+--------+------+-------+-------+
|  1 | Abe      |     1 |   14 |    150 |    1 |   100 |  1000 |
|  2 | Asou     |     2 |   13 |    150 |    2 |  NULL |    60 |
|  3 | Inami    |     1 |   13 |    150 |    3 |    50 |   500 |
|  4 | Asou     |     2 |   15 |    150 |    4 |    30 |   600 |
|  5 | Imamura  |     3 |   12 |    155 |    5 |    10 |    10 |
|  6 | Takeuchi |     2 |   16 |    155 |    6 |  NULL |    40 |
|  7 | Kimura   |     3 |   11 |    160 |    7 |   100 |  1000 |
|  8 | Sato     |     7 |   14 |    160 |    8 |  2000 |   100 |
+----+----------+-------+------+--------+------+-------+-------+
8 rows in set (0.00 sec)

MariaDB [TEST1]

#### <練習問題 3>
meiboテーブルにidをキーとして、上記のテーブルを外部結合させてください。

In [96]:
select * from meibo left join cardtb on meibo.id = cardtb.id

select * from meibo left join cardtb on meibo.id = cardtb.id;
+----+----------+-------+------+--------+------+-------+-------+
| id | name     | class | age  | height | id   | point | money |
+----+----------+-------+------+--------+------+-------+-------+
|  1 | Abe      |     1 |   14 |    150 |    1 |   100 |  1000 |
|  2 | Asou     |     2 |   13 |    150 |    2 |  NULL |    60 |
|  3 | Inami    |     1 |   13 |    150 |    3 |    50 |   500 |
|  4 | Asou     |     2 |   15 |    150 |    4 |    30 |   600 |
|  5 | Imamura  |     3 |   12 |    155 |    5 |    10 |    10 |
|  6 | Takeuchi |     2 |   16 |    155 |    6 |  NULL |    40 |
|  7 | Kimura   |     3 |   11 |    160 |    7 |   100 |  1000 |
|  8 | Sato     |     7 |   14 |    160 |    8 |  2000 |   100 |
+----+----------+-------+------+--------+------+-------+-------+
8 rows in set (0.00 sec)

MariaDB [TEST1]

### 5.2.6 case文とサブクエリ
キーワード：case文、サブクエリ

データを処理していると、条件分岐をし、それぞれを集計したいという場合があります。SQLでは条件分岐処理もできます。以下では、クラス番号が「1,2,3」ならば、それぞれ「A,B,C」というクラス名(className)が付与されるようにしています。

In [101]:
select 
     id, name
    ,case 
        when class = 1 then "A"
        when class = 2 then "B"
        when class = 3 then "C"
        else "others" 
    end as className
from 
    meibo;

select id, name ,case when class = 1 then "A" when class = 2 then "B" when class = 3 then "C" else "others" end as className from meibo;
+----+----------+-----------+
| id | name     | className |
+----+----------+-----------+
|  1 | Abe      | A         |
|  2 | Asou     | B         |
|  3 | Inami    | A         |
|  4 | Asou     | B         |
|  5 | Imamura  | C         |
|  6 | Takeuchi | B         |
|  7 | Kimura   | C         |
|  8 | Sato     | others    |
+----+----------+-----------+
8 rows in set (0.00 sec)

MariaDB [TEST1]

次は「サブクエリ」といいます。サブクエリを使用すると、元となるテーブルから必要な情報を取り出し、さらにそれをテーブルとして取り扱うことができます。この例ではmeiboテーブルの内容をサブクエリを用いてテーブルbとして扱っています。

In [103]:
select b.name,b.age from 
 (select a.age,a.name from meibo a where a.class = 1) b;

select b.name,b.age from (select a.age,a.name from meibo a where a.class = 1) b;
+-------+------+
| name  | age  |
+-------+------+
| Abe   |   14 |
| Inami |   13 |
+-------+------+
2 rows in set (0.00 sec)

MariaDB [TEST1]

なお、上記はカラム名を指定していますが、全てのカラムをもってきたい場合は、エイリアス名の後にドットアスタリスク（.*）をつけます。

In [61]:
select b.* from 
 (select a.* from meibo a where a.class = 1) b;

select b.* from (select a.* from meibo a where a.class = 1) b;
+----+--------+-------+------+
| id | name   | class | age  |
+----+--------+-------+------+
|  1 | Yamada |     1 |   14 |
|  3 | Suzuki |     1 |   13 |
|  8 | Sato   |     1 |   14 |
+----+--------+-------+------+
3 rows in set (0.00 sec)

以上で、SQLの基礎的な操作は完了です。練習問題の後は、ビューについて学びます。

>**[ポイント]**

>case when 条件 then A else B end as カラム名設定：条件分岐

#### <練習問題 1>

meiboテーブルで、highが155未満の場合は"below_155"、155ぴったりならば"equal_155"、155より大きいならば"over_155"と名付けて、テーブルを表示させてください。

In [106]:
select id,name
    ,case
        when height < 155 then 'below_155'
        when height = 155 then 'equal_155'
        when height > 155 then 'over_155'
        else 'others'
    end as highlevel
from meibo

select id,name ,case when height < 155 then 'below_155' when height = 155 then 'equal_155' when height > 155 then 'over_155' else 'others' end as highlevel from meibo;
+----+----------+-----------+
| id | name     | highlevel |
+----+----------+-----------+
|  1 | Abe      | below_155 |
|  2 | Asou     | below_155 |
|  3 | Inami    | below_155 |
|  4 | Asou     | below_155 |
|  5 | Imamura  | equal_155 |
|  6 | Takeuchi | equal_155 |
|  7 | Kimura   | over_155  |
|  8 | Sato     | over_155  |
+----+----------+-----------+
8 rows in set (0.00 sec)

MariaDB [TEST1]

#### <練習問題 2>
上記のテーブルとサブクエリの考え方を利用して、それぞれのhighlevelの人数を求めてください。

In [108]:
select b.highlevel, count(b.id)
    from (
        select id,
            case
                when height < 155 then 'below_155'
                when height = 155 then 'equal_155'
                when height > 155 then 'over_155'
            end as highlevel
        from meibo
    ) b
    group by b.highlevel

select b.highlevel, count(b.id) from ( select id, case when height < 155 then 'below_155' when height = 155 then 'equal_155' when height > 155 then 'over_155' end as highlevel from meibo ) b group by b.highlevel;
+-----------+-------------+
| highlevel | count(b.id) |
+-----------+-------------+
| below_155 |           4 |
| equal_155 |           2 |
| over_155  |           2 |
+-----------+-------------+
3 rows in set (0.00 sec)

MariaDB [TEST1]

#### <練習問題 3>
上記のテーブルとサブクエリの考え方を利用して、それぞれのhighlevelの平均年齢を求めてください。

In [9]:
select b.highlevel, avg(b.age)
    from (
        select age,
            case
                when height < 155 then 'below_155'
                when height = 155 then 'equal_155'
                when height > 155 then 'over_155'
            end as highlevel
        from meibo
    ) b
    group by b.highlevel

select b.highlevel, avg(b.age) from ( select age, case when height < 155 then 'below_155' when height = 155 then 'equal_155' when height > 155 then 'over_155' end as highlevel from meibo ) b group by b.highlevel;
+-----------+------------+
| highlevel | avg(b.age) |
+-----------+------------+
| below_155 |    13.7500 |
| equal_155 |    14.0000 |
| over_155  |    12.5000 |
+-----------+------------+
3 rows in set (0.00 sec)

MariaDB [TEST1]

## 5.3 ビュー
ゴール：ビューの概念を理解し、作成や操作ができる

### 5.3.1 ビュー
キーワード：ビュー

次は、ビューについて学びます。これまでは、直接テーブルからデータを問い合わせて、必要な情報を取得していましたが、毎回条件を設定して各テーブルからデータを抽出するのは、少し面倒です。とはいえ、必要な情報を各テーブルから取得したテーブルを作成したとしても、元データの更新のたびにそのテーブルも更新する必要があるので、やはり面倒です。このようなとき、ビューを活用することで、常に最新のデータを簡単に抽出することができるようになります。ビューは、あらかじめ検索する方法を記録させておく仮想のテーブルです。

ビューの作成方法はテーブルとほぼ同じで、create viewを使います。まずは、簡単な例からみていきましょう。meiboテーブルから、idとnameだけを持ってくるビューを作成しています。

In [10]:
create view v1
    as
select id,name
    from meibo;

create view v1 as select id,name from meibo;
 Query OK, 0 rows affected (0.01 sec)

MariaDB [TEST1]

新しいビューができているか見てみましょう。やり方は以前学んだ方法と同じです。

In [11]:
select * from v1;

select * from v1;
+----+----------+
| id | name     |
+----+----------+
|  1 | Abe      |
|  2 | Asou     |
|  3 | Inami    |
|  4 | Asou     |
|  5 | Imamura  |
|  6 | Takeuchi |
|  7 | Kimura   |
|  8 | Sato     |
+----+----------+
8 rows in set (0.00 sec)

MariaDB [TEST1]

これだけだとあまりビューの便利さわからないので、次の例を見てみましょう。前に作成した少し複雑なテーブルもビューを作成しておけば、いつでも呼び出すことができます。

In [12]:
create view v2
    as
select 
     id
    ,name
    ,case 
        when class = 1 then "A"
        when class = 2 then "B"
        when class = 3 then "C"
        else "others" 
    end as className
from 
    meibo;

create view v2 as select id ,name ,case when class = 1 then "A" when class = 2 then "B" when class = 3 then "C" else "others" end as className from meibo;
 Query OK, 0 rows affected (0.01 sec)

MariaDB [TEST1]

以下のビューを設定しておけば、欲しい検索結果を以下のようなSQL文だけで呼び出すことができます。

In [13]:
select * from v2;

select * from v2;
+----+----------+-----------+
| id | name     | className |
+----+----------+-----------+
|  1 | Abe      | A         |
|  2 | Asou     | B         |
|  3 | Inami    | A         |
|  4 | Asou     | B         |
|  5 | Imamura  | C         |
|  6 | Takeuchi | B         |
|  7 | Kimura   | C         |
|  8 | Sato     | others    |
+----+----------+-----------+
8 rows in set (0.00 sec)

MariaDB [TEST1]

ビューを更新することもできます。試しに以下のデータを挿入してみましょう。

In [14]:
insert into v1 (id, name) values (100, "dummy_Yamada");
insert into v1 (id, name) values (200, "dummy_Tanaka");
insert into v1 (id, name) values (300, "dummy_Sato");

insert into v1 (id, name) values (100, "dummy_Yamada"); insert into v1 (id, name) values (200, "dummy_Tanaka"); insert into v1 (id, name) values (300, "dummy_Sato");
 Query OK, 1 row affected (0.00 sec)

Query OK, 1 row affected (0.00 sec)

Query OK, 1 row affected (0.00 sec)

MariaDB [TEST1]

In [15]:
select * from v1;

select * from v1;
+-----+--------------+
| id  | name         |
+-----+--------------+
|   1 | Abe          |
|   2 | Asou         |
|   3 | Inami        |
|   4 | Asou         |
|   5 | Imamura      |
|   6 | Takeuchi     |
|   7 | Kimura       |
|   8 | Sato         |
| 100 | dummy_Yamada |
| 200 | dummy_Tanaka |
| 300 | dummy_Sato   |
+-----+--------------+
11 rows in set (0.00 sec)

MariaDB [TEST1]

ただし、ビューを更新すると、元の参照テーブルも変更されるので、注意してください。

In [16]:
select * from meibo;

select * from meibo;
+-----+--------------+-------+------+--------+
| id  | name         | class | age  | height |
+-----+--------------+-------+------+--------+
|   1 | Abe          |     1 |   14 |    150 |
|   2 | Asou         |     2 |   13 |    150 |
|   3 | Inami        |     1 |   13 |    150 |
|   4 | Asou         |     2 |   15 |    150 |
|   5 | Imamura      |     3 |   12 |    155 |
|   6 | Takeuchi     |     2 |   16 |    155 |
|   7 | Kimura       |     3 |   11 |    160 |
|   8 | Sato         |     7 |   14 |    160 |
| 100 | dummy_Yamada |  NULL | NULL |   NULL |
| 200 | dummy_Tanaka |  NULL | NULL |   NULL |
| 300 | dummy_Sato   |  NULL | NULL |   NULL |
+-----+--------------+-------+------+--------+
11 rows in set (0.00 sec)

MariaDB [TEST1]

ビューを更新するときは、元のテーブルへの影響範囲を十分に考え、注意しましょう。ただし、ビューが更新できないこともありますので、練習問題で見てみることにします。

以下のコマンドで、ビューであることわかります。

In [17]:
show table status;

show table status;
+--------+--------+---------+------------+------+----------------+-------------+------------------+--------------+-----------+----------------+---------------------+---------------------+------------+-------------------+----------+----------------+---------+
| Name   | Engine | Version | Row_format | Rows | Avg_row_length | Data_length | Max_data_length  | Index_length | Data_free | Auto_increment | Create_time         | Update_time         | Check_time | Collation         | Checksum | Create_options | Comment |
+--------+--------+---------+------------+------+----------------+-------------+------------------+--------------+-----------+----------------+---------------------+---------------------+------------+-------------------+----------+----------------+---------+
| cardtb | InnoDB |      10 | Compact    |    8 |           2048 |       16384 |                0 |            0 |         0 |           NULL | 2017-05-17 04:46:48 | NULL                | NULL       | latin1_swedish_ci |     NULL |                |         |
| meibo  | MyISAM |      10 | Dynamic    |   11 |             38 |         428 |  281474976710655 |         2048 |         0 |           NULL | 2017-05-17 02:12:00 | 2017-05-17 04:54:04 | NULL       | utf8_general_ci   |     NULL |                |         |
| meibo2 | MyISAM |      10 | Dynamic    |    5 |             28 |         144 |  281474976710655 |         2048 |         0 |           NULL | 2017-05-17 02:47:24 | 2017-05-17 02:49:56 | NULL       | utf8_general_ci   |     NULL |                |         |
| score  | MyISAM |      10 | Fixed      |    9 |             17 |         153 | 4785074604081151 |         2048 |         0 |           NULL | 2017-05-17 02:52:51 | 2017-05-17 02:53:05 | NULL       | utf8_general_ci   |     NULL |                |         |
| v1     | NULL   |    NULL | NULL       | NULL |           NULL |        NULL |             NULL |         NULL |      NULL |           NULL | NULL                | NULL                | NULL       | NULL              |     NULL | NULL           | VIEW    |
| v2     | NULL   |    NULL | NULL       | NULL |           NULL |        NULL |             NULL |         NULL |      NULL |           NULL | NULL                | NULL                | NULL       | NULL              |     NULL | NULL           | VIEW    |
+--------+--------+---------+------------+------+----------------+-------------+------------------+--------------+-----------+----------------+---------------------+---------------------+------------+-------------------+----------+----------------+---------+
6 rows in set (0.00 sec)

MariaDB [TEST1]

#### <練習問題 1>
テーブルmeibo2からidとnameを取り出して、ビューのv3を作成してみましょう。

In [20]:
create view v3 as select id, name from meibo2

create view v3 as select id, name from meibo2;
 Query OK, 0 rows affected (0.00 sec)

MariaDB [TEST1]

In [21]:
select * from v3

select * from v3;
+----+----------+
| id | name     |
+----+----------+
|  1 | Abe      |
|  9 | Nagata   |
| 10 | Sugino   |
| 11 | Takayama |
| 12 | Jon      |
+----+----------+
5 rows in set (0.00 sec)

MariaDB [TEST1]

#### <練習問題 2>
meiboテーブルとscoreテーブルを内部結合して、idとnameを取り出すビューv4を作成してみましょう。

In [31]:
create view v4
    as select meibo.id, name , math, english, science from meibo join score on meibo.id = score.id

create view v4 as select meibo.id, name , math, english, science from meibo join score on meibo.id = score.id;
 Query OK, 0 rows affected (0.01 sec)

MariaDB [TEST1]

In [32]:
select * from v4

select * from v4;
+----+----------+------+---------+---------+
| id | name     | math | english | science |
+----+----------+------+---------+---------+
|  1 | Abe      |   10 |      10 |      40 |
|  2 | Asou     | NULL |      60 |     100 |
|  3 | Inami    |   30 |      40 |      60 |
|  5 | Imamura  |   25 |      31 |      10 |
|  6 | Takeuchi |   50 |      30 |      10 |
|  8 | Sato     |   90 |     100 |      90 |
+----+----------+------+---------+---------+
6 rows in set (0.00 sec)

MariaDB [TEST1]

#### <練習問題 3>
上記で作成したテーブルに新しいデータを追加してみましょう。どうなりますか？

***

## 5.4 総合問題

### 5.4.1 総合問題1

以下のデータベースを使って、後の問いに答えてください。(以下のURLにある注意事項等も参照ください。)

https://dev.mysql.com/doc/world-setup/en/

データベースをインストールする方法は以下のコマンドを実行してください(**ただし、terminal上で実行する必要があります。**terminalはJupyterのトップ画面から、右上にある「New」をクリックすると表示されます。手順としては、mkdirでフォルダ（chapter5など）を作成した後に、以下のコマンドを実行し、エラーがないことを確認したら、ここへ戻ってデータベースがあることを確認し、問題に取り組んでください。なお、このページの上にある「Kernel」をクリックし、Change kernelでPythonに変更して実行しても大丈夫です。ただし、sqlを実行する場合は、Kernelをsqlに戻してください。)。

-------------------
wget http://downloads.mysql.com/docs/world.sql.gz  
gzip -d world.sql.gz  
mysql -h"db1" -P"3306" -u root -p"ilect" < world.sql    

-------------------

(1) データベースworldを選択して、どのようなテーブルがあるか、またそれぞれどのようなカラムがあるか表示してください。  
(2) それぞれのテーブルについて、それぞれ5行ずつ表示させてください。どんなデータがあるか軽く確認してください。  
(3) cityテーブルについて、レコード数をカウントしてください。また、重複するデータがあるかどうか、チェックしてください。

In [34]:
use world;
show tables

use world; show tables;
+-----------------+
| Tables_in_world |
+-----------------+
| city            |
| country         |
| countrylanguage |
+-----------------+
3 rows in set (0.00 sec)

MariaDB [world]

In [35]:
desc city;
desc country;
desc countrylanguage

desc city; desc country; desc countrylanguage;
+-------------+----------+------+-----+---------+----------------+
| Field       | Type     | Null | Key | Default | Extra          |
+-------------+----------+------+-----+---------+----------------+
| ID          | int(11)  | NO   | PRI | NULL    | auto_increment |
| Name        | char(35) | NO   |     |         |                |
| CountryCode | char(3)  | NO   | MUL |         |                |
| District    | char(20) | NO   |     |         |                |
| Population  | int(11)  | NO   |     | 0       |                |
+-------------+----------+------+-----+---------+----------------+
5 rows in set (0.00 sec)

+----------------+---------------------------------------------------------------------------------------+------+-----+---------+-------+
| Field          | Type                                                                                  | Null | Key | Default | Extra |
+----------------+---------------------------------------------------------------------------------------+------+-----+---------+-------+
| Code           | char(3)                                                                               | NO   | PRI |         |       |
| Name           | char(52)                                                                              | NO   |     |         |       |
| Continent      | enum('Asia','Europe','North America','Africa','Oceania','Antarctica','South America') | NO   |     | Asia    |       |
| Region         | char(26)                                                                              | NO   |     |         |       |
| SurfaceArea    | float(10,2)                                                                           | NO   |     | 0.00    |       |
| IndepYear      | smallint(6)                                                                           | YES  |     | NULL    |       |
| Population     | int(11)                                                                               | NO   |     | 0       |       |
| LifeExpectancy | float(3,1)                                                                            | YES  |     | NULL    |       |
| GNP            | float(10,2)                                                                           | YES  |     | NULL    |       |
| GNPOld         | float(10,2)                                                                           | YES  |     | NULL    |       |
| LocalName      | char(45)                                                                              | NO   |     |         |       |
| GovernmentForm | char(45)                                                                              | NO   |     |         |       |
| HeadOfState    | char(60)                                                                              | YES  |     | NULL    |       |
| Capital        | int(11)                                                                               | YES  |     | NULL    |       |
| Code2          | char(2)                                                                               | NO   |     |         |       |
+----------------+---------------------------------------------------------------------------------------+------+-----+---------+-------+
15 rows in set (0.00 sec)

+-------------+---------------+------+-----+---------+-------+
| Field       | Type          | Null | Key | Default | Extra |
+-------------+---------------+------+-----+---------+-------+
| CountryCode | char(3)       | NO   | PRI |         |       |
| Language    | char(30)      | NO   | PRI |         |       |
| IsOfficial  | enum('T','F') | NO   |     | F       |       |
| Percentage  | float(4,1)    | NO   |     | 0.0     |       |
+-------------+---------------+------+-----+---------+-------+
4 rows in set (0.00 sec)

MariaDB [world]

In [39]:
select * from city limit 5;
select * from country limit 5;
select * from countrylanguage limit 5

select * from city limit 5; select * from country limit 5; select * from countrylanguage limit 5;
+----+----------------+-------------+---------------+------------+
| ID | Name           | CountryCode | District      | Population |
+----+----------------+-------------+---------------+------------+
|  1 | Kabul          | AFG         | Kabol         |    1780000 |
|  2 | Qandahar       | AFG         | Qandahar      |     237500 |
|  3 | Herat          | AFG         | Herat         |     186800 |
|  4 | Mazar-e-Sharif | AFG         | Balkh         |     127800 |
|  5 | Amsterdam      | NLD         | Noord-Holland |     731200 |
+----+----------------+-------------+---------------+------------+
5 rows in set (0.00 sec)

+------+-------------+---------------+---------------------------+-------------+-----------+------------+----------------+---------+---------+-----------------------+----------------------------------------------+--------------------------+---------+-------+
| Code | Name        | Continent     | Region                    | SurfaceArea | IndepYear | Population | LifeExpectancy | GNP     | GNPOld  | LocalName             | GovernmentForm                               | HeadOfState              | Capital | Code2 |
+------+-------------+---------------+---------------------------+-------------+-----------+------------+----------------+---------+---------+-----------------------+----------------------------------------------+--------------------------+---------+-------+
| ABW  | Aruba       | North America | Caribbean                 |      193.00 |      NULL |     103000 |           78.4 |  828.00 |  793.00 | Aruba                 | Nonmetropolitan Territory of The Netherlands | Beatrix                  |     129 | AW    |
| AFG  | Afghanistan | Asia          | Southern and Central Asia |   652090.00 |      1919 |   22720000 |           45.9 | 5976.00 |    NULL | Afganistan/Afqanestan | Islamic Emirate                              | Mohammad Omar            |       1 | AF    |
| AGO  | Angola      | Africa        | Central Africa            |  1246700.00 |      1975 |   12878000 |           38.3 | 6648.00 | 7984.00 | Angola                | Republic                                     | José Eduardo dos Santos  |      56 | AO    |
| AIA  | Anguilla    | North America | Caribbean                 |       96.00 |      NULL |       8000 |           76.1 |   63.20 |    NULL | Anguilla              | Dependent Territory of the UK                | Elisabeth II             |      62 | AI    |
| ALB  | Albania     | Europe        | Southern Europe           |    28748.00 |      1912 |    3401200 |           71.6 | 3205.00 | 2500.00 | Shqipëria             | Republic                                     | Rexhep Mejdani           |      34 | AL    |
+------+-------------+---------------+---------------------------+-------------+-----------+------------+----------------+---------+---------+-----------------------+----------------------------------------------+--------------------------+---------+-------+
5 rows in set (0.00 sec)

+-------------+------------+------------+------------+
| CountryCode | Language   | IsOfficial | Percentage |
+-------------+------------+------------+------------+
| ABW         | Dutch      | T          |        5.3 |
| ABW         | English    | F          |        9.5 |
| ABW         | Papiamento | F          |       76.7 |
| ABW         | Spanish    | F          |        7.4 |
| AFG         | Balochi    | F          |        0.9 |
+-------------+------------+------------+------------+
5 rows in set (0.00 sec)

MariaDB [world]

In [43]:
select count(*) as countRecords from city

select count(*) as countRecords from city;
+--------------+
| countRecords |
+--------------+
|         4079 |
+--------------+
1 row in set (0.00 sec)

MariaDB [world]

### 5.4.2 総合問題2
上記と同じデータベースを使って、以下の問いに答えてください。

(1) countrylanguageテーブルについて、それぞれのCountryCodeを軸に、言語の数（テーブルにあるものだけ、重複なく）を計算してください。また、その結果をcityテーブルに紐付けて（joinして）、cityのカラム全てとその言語の数を表示してください。ただし、結果は5行のみ表示させるだけでよいです。  
(2)  countrylanguageテーブルについて、それぞれのCountryCodeを軸に、Percentageを合計してください。ただし、その合計値が99.9を超えるものだけ表示させるようにしてください。  
(3)  cityテーブルについて、DistrictのイニシャルがAではじまるもの、Bではじまるもの、Cではじまるもの、その他(others)の4パターンに分けて、それぞれのレコード数をカウントしてください。

In [52]:
select city.*, tmp.CountLanguage 
    from city
        join
        (select CountryCode, count(Language) as CountLanguage from countrylanguage group by CountryCode) tmp
        on city.CountryCode = tmp.CountryCode
    limit 5

select city.*, tmp.CountLanguage from city join (select CountryCode, count(Language) as CountLanguage from countrylanguage group by CountryCode) tmp on city.CountryCode = tmp.CountryCode limit 5;
+-----+----------------+-------------+----------+------------+---------------+
| ID  | Name           | CountryCode | District | Population | CountLanguage |
+-----+----------------+-------------+----------+------------+---------------+
| 129 | Oranjestad     | ABW         | –        |      29034 |             4 |
|   1 | Kabul          | AFG         | Kabol    |    1780000 |             5 |
|   2 | Qandahar       | AFG         | Qandahar |     237500 |             5 |
|   3 | Herat          | AFG         | Herat    |     186800 |             5 |
|   4 | Mazar-e-Sharif | AFG         | Balkh    |     127800 |             5 |
+-----+----------------+-------------+----------+------------+---------------+
5 rows in set (0.00 sec)

MariaDB [world]

In [55]:
select CountryCode,sum(Percentage) as sum from countrylanguage group by CountryCode having sum>99.9 limit 5

select CountryCode,sum(Percentage) as sum from countrylanguage group by CountryCode having sum>99.9 limit 5;
+-------------+-------+
| CountryCode | sum   |
+-------------+-------+
| BHS         | 100.0 |
| BMU         | 100.0 |
| BTN         | 100.0 |
| CHL         | 100.0 |
| CPV         | 100.0 |
+-------------+-------+
5 rows in set (0.00 sec)

MariaDB [world]

In [56]:
select case
        when District like 'A%' then 'A'
        when District like 'B%' then 'B'
        when District like 'C%' then 'C'
        else 'others'
        end as Initial
        , count(*)
    from city group by Initial

select case when District like 'A%' then 'A' when District like 'B%' then 'B' when District like 'C%' then 'C' else 'others' end as Initial , count(*) from city group by Initial;
+---------+----------+
| Initial | count(*) |
+---------+----------+
| A       |      273 |
| B       |      217 |
| C       |      326 |
| others  |     3263 |
+---------+----------+
4 rows in set (0.00 sec)

MariaDB [world]